; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v5)
             (pred_6 ?v10 ?v3)
             (pred_3 ?v9 ?v3)
             (pred_8 ?v2 ?v9 )
	     (pred_1 ?v9)
             (pred_7 ?v8)
             (pred_9 ?v10)
             (pred_4 ?v3)
             (pred_10 ?v9)
             (pred_5 ?v10)
             (pred_2 ?v9)
             (pred_12 ))



(:action op_1
:parameters (?v4 ?v13 ?v7 ?v6)
:precondition (and (pred_7 ?v4) (pred_7 ?v13) (pred_9 ?v7) (pred_4 ?v6)
          (pred_11 ?v4 ?v13) (pred_6 ?v7 ?v6)
                   (pred_3 ?v13 ?v6) (pred_1 ?v4) 
                   (pred_10 ?v13) (pred_5 ?v7))
:effect (and  (pred_2 ?v13) (not (pred_10 ?v13))))


(:action op_4
:parameters (?v4 ?v1)
:precondition (and (pred_7 ?v4) (pred_7 ?v1)
               (pred_1 ?v4) (pred_11 ?v4 ?v1) (pred_2 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v4))))

(:action op_3
:parameters (?v4 ?v7)
:precondition (and (pred_7 ?v4) (pred_9 ?v7) 
                  (pred_1 ?v4) (pred_8 ?v7 ?v4) (pred_12 ))
:effect (and (pred_5 ?v7)
   (not (pred_8 ?v7 ?v4)) (not (pred_12 ))))


(:action op_2
:parameters (?v4 ?v11 ?v12)
:precondition (and (pred_7 ?v4) (pred_9 ?v11) (pred_9 ?v12)
                  (pred_1 ?v4) (pred_5 ?v12) (pred_8 ?v11 ?v4))
:effect (and (pred_5 ?v11) (pred_8 ?v12 ?v4)
        (not (pred_5 ?v12)) (not (pred_8 ?v11 ?v4))))

(:action op_5
:parameters (?v4 ?v7)
:precondition (and (pred_7 ?v4) (pred_9 ?v7) 
                  (pred_1 ?v4) (pred_5 ?v7))
:effect (and (pred_12 ) (pred_8 ?v7 ?v4) (not (pred_5 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_11 obj_04 obj_29 obj_10 obj_26 obj_19 obj_27 obj_22 obj_18 obj_30 obj_17 obj_05 obj_21 obj_20 obj_28 obj_09 obj_16 obj_12 obj_03 obj_23 obj_14 obj_13 obj_02 obj_07
    obj_31 obj_24 obj_25
    obj_01 obj_15 obj_06
    )

    (:init
       (pred_12)

       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_10)
       (pred_7 obj_26)
       (pred_7 obj_19)
       (pred_7 obj_27)
       (pred_7 obj_22)
       (pred_7 obj_18)
       (pred_7 obj_30)
       (pred_7 obj_17)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_28)
       (pred_7 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_7 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_4 obj_31)
       (pred_4 obj_24)
       (pred_4 obj_25)
       (pred_9 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_06)

       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_04 obj_27)
       (pred_11 obj_04 obj_29)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_29 obj_10)
       (pred_11 obj_29 obj_04)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_29)
       (pred_11 obj_26 obj_30)
       (pred_11 obj_26 obj_19)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_27)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_26)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_27 obj_22)
       (pred_11 obj_27 obj_04)
       (pred_11 obj_27 obj_19)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_18)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_22 obj_27)
       (pred_11 obj_18 obj_20)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_22)
       (pred_11 obj_30 obj_28)
       (pred_11 obj_30 obj_17)
       (pred_11 obj_30 obj_26)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_17 obj_30)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_20)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_18)
       (pred_11 obj_20 obj_21)
       (pred_11 obj_28 obj_23)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_28 obj_30)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_23 obj_14)
       (pred_11 obj_23 obj_28)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_23)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_02)
       (pred_10 obj_23)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_3  obj_23 obj_31)
       (pred_3  obj_20 obj_24)
       (pred_3  obj_14 obj_25)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_2 obj_29)
       (pred_2 obj_10)
       (pred_2 obj_26)
       (pred_2 obj_19)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_18)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_21)
       (pred_2 obj_28)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_2 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_07)

       (pred_6  obj_01 obj_31)
       (pred_6  obj_15 obj_24)
       (pred_6  obj_06 obj_25)
       (pred_8 obj_01 obj_29)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_06 obj_21)
       (pred_1 obj_21)
    )

    (:goal (and
       (pred_8 obj_15 obj_16)
       (pred_8 obj_06 obj_11)
    ))
(:constraints
  (always (not (pred_1 obj_05)))
)
)

; plan
1. (op_4 obj_21 obj_12)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_12)
   goals met: 0 of 2
2. (op_4 obj_12 obj_16)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_16)
   goals met: 0 of 2
3. (op_4 obj_16 obj_09)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_15)
   deleted: (pred_8 obj_15 obj_09) (pred_12)
   added: (pred_5 obj_15)
   goals met: 0 of 2
5. (op_4 obj_09 obj_16)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_16)
   goals met: 0 of 2
6. (op_5 obj_16 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_12) (pred_8 obj_15 obj_16)
   goals met: 1 of 2
7. (op_4 obj_16 obj_12)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_12)
   goals met: 1 of 2
8. (op_4 obj_12 obj_21)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_21)
   goals met: 1 of 2
9. (op_3 obj_21 obj_06)
   deleted: (pred_8 obj_06 obj_21) (pred_12)
   added: (pred_5 obj_06)
   goals met: 1 of 2
10. (op_4 obj_21 obj_22)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_22)
   goals met: 1 of 2
11. (op_4 obj_22 obj_29)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_29)
   goals met: 1 of 2
12. (op_4 obj_29 obj_04)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_04)
   goals met: 1 of 2
13. (op_4 obj_04 obj_11)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_11)
   goals met: 1 of 2
14. (op_5 obj_11 obj_06)
   deleted: (pred_5 obj_06)
   added: (pred_12) (pred_8 obj_06 obj_11)
   goals met: 2 of 2
